test_results_20251018_190134/ab_balance_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/merchant/balance
Document Length:        82 bytes

Concurrency Level:      10
Time taken for tests:   4.539 seconds
Complete requests:      100
Failed requests:        99
   (Connect: 0, Receive: 0, Length: 99, Exceptions: 0)
Non-2xx responses:      2
Total transferred:      52508 bytes
Total body sent:        34300
HTML transferred:       6276 bytes
Requests per second:    22.03 [#/sec] (mean)
Time per request:       453.881 [ms] (mean)
Time per request:       45.388 [ms] (mean, across all concurrent requests)
Transfer rate:          11.30 [Kbytes/sec] received
                        7.38 kb/s sent
                        18.68 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      124  304 252.3    234    1920
Processing:    46   96  80.0     76     738
Waiting:       46   82  39.0     70     281
Total:        173  399 278.5    321    2131

Percentage of the requests served within a certain time (ms)
  50%    321
  66%    378
  75%    438
  80%    472
  90%    682
  95%    935
  98%   1465
  99%   2131
 100%   2131 (longest request)