test_results_20251018_190134/ab_create_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/create
Document Length:        94 bytes

Concurrency Level:      10
Time taken for tests:   4.220 seconds
Complete requests:      100
Failed requests:        99
   (Connect: 0, Receive: 0, Length: 99, Exceptions: 0)
Non-2xx responses:      5
Total transferred:      51752 bytes
Total body sent:        57700
HTML transferred:       6372 bytes
Requests per second:    23.70 [#/sec] (mean)
Time per request:       421.968 [ms] (mean)
Time per request:       42.197 [ms] (mean, across all concurrent requests)
Transfer rate:          11.98 [Kbytes/sec] received
                        13.35 kb/s sent
                        25.33 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      129  270 139.9    236    1155
Processing:    46  104  76.5     85     572
Waiting:       46   91  63.6     77     572
Total:        176  374 172.5    330    1212

Percentage of the requests served within a certain time (ms)
  50%    330
  66%    383
  75%    426
  80%    455
  90%    561
  95%    715
  98%    994
  99%   1212
 100%   1212 (longest request)