test_results_20251018_190134/ab_query_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/query
Document Length:        82 bytes

Concurrency Level:      10
Time taken for tests:   5.557 seconds
Complete requests:      100
Failed requests:        99
   (Connect: 0, Receive: 0, Length: 99, Exceptions: 0)
Non-2xx responses:      6
Total transferred:      51484 bytes
Total body sent:        38300
HTML transferred:       6388 bytes
Requests per second:    18.00 [#/sec] (mean)
Time per request:       555.707 [ms] (mean)
Time per request:       55.571 [ms] (mean, across all concurrent requests)
Transfer rate:          9.05 [Kbytes/sec] received
                        6.73 kb/s sent
                        15.78 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      120  296 186.0    252    1310
Processing:    46   99  62.0     88     429
Waiting:       46   87  41.2     83     403
Total:        166  395 199.2    364    1421

Percentage of the requests served within a certain time (ms)
  50%    364
  66%    426
  75%    457
  80%    470
  90%    584
  95%    739
  98%   1223
  99%   1421
 100%   1421 (longest request)