test_results_20251018_190134/stress_create_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient)


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/create
Document Length:        62 bytes

Concurrency Level:      50
Time taken for tests:   5.484 seconds
Complete requests:      500
Failed requests:        60
   (Connect: 0, Receive: 0, Length: 60, Exceptions: 0)
Non-2xx responses:      60
Total transferred:      249640 bytes
Total body sent:        288500
HTML transferred:       32680 bytes
Requests per second:    91.18 [#/sec] (mean)
Time per request:       548.371 [ms] (mean)
Time per request:       10.967 [ms] (mean, across all concurrent requests)
Transfer rate:          44.46 [Kbytes/sec] received
                        51.38 kb/s sent
                        95.83 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      122  302 229.3    224    1652
Processing:    45  112  98.0     80     944
Waiting:       43   79  33.6     71     518
Total:        170  414 283.8    316    1831

Percentage of the requests served within a certain time (ms)
  50%    316
  66%    390
  75%    462
  80%    563
  90%    787
  95%   1022
  98%   1292
  99%   1692
 100%   1831 (longest request)